## Merging

In [2]:
import numpy as np;
import pandas as pd;

In [3]:
employees = {
    "Employee_ID": [1001, 1002,1003,1004, 1005],
    "Name": ["Rohit Kukereja","Raman Singh", "Tom Holland", "Robert Downey Junior", "Christopher Nolan"],
    "Department": ["Science", "Technical", "Film Making", "Direction", "Acting"]
    }
df = pd.DataFrame(employees);
print(df);

   Employee_ID                  Name   Department
0         1001        Rohit Kukereja      Science
1         1002           Raman Singh    Technical
2         1003           Tom Holland  Film Making
3         1004  Robert Downey Junior    Direction
4         1005     Christopher Nolan       Acting

In [4]:
salary = {
    "Employee_ID": [1001, 1002, 1003, 1006, 1007],
    "Salary":[12345,45678,78945,25896,478956],
    "Bonus": [5624,4587,9658,3665,1478]
    
}
df_2 = pd.DataFrame(salary);
print(df_2);

   Employee_ID  Salary  Bonus
0         1001   12345   5624
1         1002   45678   4587
2         1003   78945   9658
3         1006   25896   3665
4         1007  478956   1478

In [17]:
print(pd.merge(df, df_2));
print("\nOn the basis of comman ID");
print(pd.merge(df, df_2,  on="Employee_ID", how = "inner"));
print("\nPrint all data on the basis of ID");
print(pd.merge(df, df_2, on="Employee_ID", how="outer"));
print("\nOn the basis of employees");
print(pd.merge(df,df_2, on="Employee_ID", how="left"));
print("\nOn the basis of salary");
print(pd.merge(df, df_2, on="Employee_ID", how="right"));

   Employee_ID            Name   Department  Salary  Bonus
0         1001  Rohit Kukereja      Science   12345   5624
1         1002     Raman Singh    Technical   45678   4587
2         1003     Tom Holland  Film Making   78945   9658

On the basis of comman ID
   Employee_ID            Name   Department  Salary  Bonus
0         1001  Rohit Kukereja      Science   12345   5624
1         1002     Raman Singh    Technical   45678   4587
2         1003     Tom Holland  Film Making   78945   9658

Print all data on the basis of ID
   Employee_ID                  Name   Department    Salary   Bonus
0         1001        Rohit Kukereja      Science   12345.0  5624.0
1         1002           Raman Singh    Technical   45678.0  4587.0
2         1003           Tom Holland  Film Making   78945.0  9658.0
3         1004  Robert Downey Junior    Direction       NaN     NaN
4         1005     Christopher Nolan       Acting       NaN     NaN
5         1006                   NaN          NaN   25896.0  3665.0
6         1007                   NaN          NaN  478956.0  1478.0

On the basis of employees
   Employee_ID                  Name   Department   Salary   Bonus
0         1001        Rohit Kukereja      Science  12345.0  5624.0
1         1002           Raman Singh    Technical  45678.0  4587.0
2         1003           Tom Holland  Film Making  78945.0  9658.0
3         1004  Robert Downey Junior    Direction      NaN     NaN
4         1005     Christopher Nolan       Acting      NaN     NaN

On the basis of salary
   Employee_ID            Name   Department  Salary  Bonus
0         1001  Rohit Kukereja      Science   12345   5624
1         1002     Raman Singh    Technical   45678   4587
2         1003     Tom Holland  Film Making   78945   9658
3         1006             NaN          NaN   25896   3665
4         1007             NaN          NaN  478956   1478

## Concatenation

In [18]:

employees = {
    "Employee_ID": [1001, 1002,1003,1004, 1005],
    "Name": ["Rohit Kukereja","Raman Singh", "Tom Holland", "Robert Downey Junior", "Christopher Nolan"],
    "Department": ["Science", "Technical", "Film Making", "Direction", "Acting"]
    }
df = pd.DataFrame(employees);
print(df);

   Employee_ID                  Name   Department
0         1001        Rohit Kukereja      Science
1         1002           Raman Singh    Technical
2         1003           Tom Holland  Film Making
3         1004  Robert Downey Junior    Direction
4         1005     Christopher Nolan       Acting

In [19]:
salary = {
    "Employee_ID": [1001, 1002, 1003, 1006, 1007],
    "Salary":[12345,45678,78945,25896,478956],
    "Bonus": [5624,4587,9658,3665,1478]
    
}
df_2 = pd.DataFrame(salary);
print(df_2);

   Employee_ID  Salary  Bonus
0         1001   12345   5624
1         1002   45678   4587
2         1003   78945   9658
3         1006   25896   3665
4         1007  478956   1478

In [20]:
print(pd.concat([df, df_2]));

   Employee_ID                  Name   Department    Salary   Bonus
0         1001        Rohit Kukereja      Science       NaN     NaN
1         1002           Raman Singh    Technical       NaN     NaN
2         1003           Tom Holland  Film Making       NaN     NaN
3         1004  Robert Downey Junior    Direction       NaN     NaN
4         1005     Christopher Nolan       Acting       NaN     NaN
0         1001                   NaN          NaN   12345.0  5624.0
1         1002                   NaN          NaN   45678.0  4587.0
2         1003                   NaN          NaN   78945.0  9658.0
3         1006                   NaN          NaN   25896.0  3665.0
4         1007                   NaN          NaN  478956.0  1478.0

In [23]:
print(pd.concat([df, df_2], axis = 1));

   Employee_ID                  Name   Department  Employee_ID  Salary  Bonus
0         1001        Rohit Kukereja      Science         1001   12345   5624
1         1002           Raman Singh    Technical         1002   45678   4587
2         1003           Tom Holland  Film Making         1003   78945   9658
3         1004  Robert Downey Junior    Direction         1006   25896   3665
4         1005     Christopher Nolan       Acting         1007  478956   1478

## Joining two DataFrames

In [28]:
df1 = pd.DataFrame({
    "Name": ["Tom", "Bob", "Jack", "Robert"]
}, index = [1, 2, 3, 4]);
print(df1);
df2 = pd.DataFrame({
    "Score": [99,98,97,96]
}, index = [2, 3, 4, 5])
print(df2);

     Name
1     Tom
2     Bob
3    Jack
4  Robert
   Score
2     99
3     98
4     97
5     96

In [33]:
print(df1.join(df2));
print("\n");
print(df1.join(df2, how="outer"));
print("\n");
print(df1.join(df2, how="inner"));

     Name  Score
1     Tom    NaN
2     Bob   99.0
3    Jack   98.0
4  Robert   97.0


     Name  Score
1     Tom    NaN
2     Bob   99.0
3    Jack   98.0
4  Robert   97.0
5     NaN   96.0


     Name  Score
2     Bob     99
3    Jack     98
4  Robert     97